heat-sim-fast/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              0.01;
transportModel  Newtonian;
beta            0; // Heat expansion
TRef            300;
Pr              6.9; // Prandtl number (ratio of convectivity and conductivity, 6.9 is value for water)
Prt             6.9; // Turbulent Prandtl number


// ************************************************************************* //
